'''Даны два числа 
A
 и 
B
. Вам нужно вычислить их сумму 
A
+
B
. В этой задаче для работы с входными и выходными данными вы можете использовать и файлы и потоки на ваше усмотрение.'''


string = input()
a = int(string.split()[0])
b = int(string.split()[1])

print(a + b)